nxp-appcodehub/dm-mc-pmsm-triple-mcxa34x/board/pin_mux.h
/*
 * Copyright 2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_DSE_dse0 0x00u /*!<@brief Drive Strength Enable: Low */
#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFreeMASTER_UARTPins(void);

#define PCR_IBE_ibe1 0x01u          /*!<@brief Input Buffer Enable: Enables */
#define PCR_PE_pe1 0x01u            /*!<@brief Pull Enable: Enables */
#define PCR_PS_ps1 0x01u            /*!<@brief Pull Select: Enables internal pullup resistor */
#define PORT2_PCR25_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT3_29 (number 50), USER_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_USER_LED_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_USER_LED_GPIO_PIN 29U              /*!<@brief GPIO pin number */
#define BOARD_INITLEDSPINS_USER_LED_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_USER_LED_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_USER_LED_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_USER_LED_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT2_25 (number 44), LED_RED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_RED_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_RED_GPIO_PIN 25U              /*!<@brief GPIO pin number */
#define BOARD_INITLEDSPINS_LED_RED_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_LED_RED_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_RED_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_RED_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

#define PCR_IBE_ibe1 0x01u         /*!<@brief Input Buffer Enable: Enables */
#define PORT4_PCR2_MUX_mux11 0x03u /*!<@brief Pin Multiplex Control: Alternative 3 (chip-specific) */
#define PORT4_PCR5_MUX_mux11 0x03u /*!<@brief Pin Multiplex Control: Alternative 3 (chip-specific) */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUARTPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT3_0 (number 73), MC1_AT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM0PINS_MC1_AT_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM0PINS_MC1_AT_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM0PINS_MC1_AT_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT3_1 (number 72), MC1_AB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM0PINS_MC1_AB_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM0PINS_MC1_AB_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM0PINS_MC1_AB_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT3_8 (number 69), MC1_BT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM0PINS_MC1_BT_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM0PINS_MC1_BT_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM0PINS_MC1_BT_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT3_9 (number 68), MC1_BB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM0PINS_MC1_BB_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM0PINS_MC1_BB_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM0PINS_MC1_BB_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT3_10 (number 67), MC1_CT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM0PINS_MC1_CT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM0PINS_MC1_CT_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM0PINS_MC1_CT_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_11 (number 66), MC1_CB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM0PINS_MC1_CB_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM0PINS_MC1_CB_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM0PINS_MC1_CB_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                            /* @} */

