nxp-appcodehub/dm-mc-pmsm-triple-mcxa34x/board/pin_mux.h
/*! @name PORT3_6 (number 71), PFC_AT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM0PINS_PFC_AT_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM0PINS_PFC_AT_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM0PINS_PFC_AT_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT3_7 (number 70), PFC_BT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM0PINS_PFC_BT_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM0PINS_PFC_BT_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM0PINS_PFC_BT_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_0 (number 91), FAULT_1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM0PINS_FAULT_1_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM0PINS_FAULT_1_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM0PINS_FAULT_1_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT1_1 (number 92), FAULT_2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM0PINS_FAULT_2_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM0PINS_FAULT_2_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM0PINS_FAULT_2_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWM0Pins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT3_16 (number 59), MC2_AT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM1PINS_MC2_AT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM1PINS_MC2_AT_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM1PINS_MC2_AT_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_17 (number 58), MC2_AB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM1PINS_MC2_AB_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM1PINS_MC2_AB_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM1PINS_MC2_AB_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_14 (number 61), MC2_BT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM1PINS_MC2_BT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM1PINS_MC2_BT_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM1PINS_MC2_BT_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_15 (number 60), MC2_BB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM1PINS_MC2_BB_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM1PINS_MC2_BB_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM1PINS_MC2_BB_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_12 (number 63), MC2_CT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM1PINS_MC2_CT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM1PINS_MC2_CT_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM1PINS_MC2_CT_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_13 (number 62), MC2_CB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM1PINS_MC2_CB_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM1PINS_MC2_CB_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM1PINS_MC2_CB_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_27 (number 52), MC3_AT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM1PINS_MC3_AT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM1PINS_MC3_AT_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM1PINS_MC3_AT_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_28 (number 51), MC3_AB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPWM1PINS_MC3_AB_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPWM1PINS_MC3_AB_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITPWM1PINS_MC3_AB_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWM1Pins(void);

#define PCR_IBE_ibe0 0x00u /*!<@brief Input Buffer Enable: Disables */

/*! @name PORT0_20 (number 87), MC1_I_phA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC0PINS_MC1_I_phA_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC0PINS_MC1_I_phA_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITADC0PINS_MC1_I_phA_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT0_21 (number 88), MC1_I_phB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC0PINS_MC1_I_phB_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC0PINS_MC1_I_phB_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITADC0PINS_MC1_I_phB_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                               /* @} */

