nxp-appcodehub/dm-mc-pmsm-triple-mcxa34x/board/pin_mux.h
/*! @name PORT0_22 (number 89), MC1_I_phC
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC0PINS_MC1_I_phC_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC0PINS_MC1_I_phC_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITADC0PINS_MC1_I_phC_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT0_23 (number 90), MC1_CUR_DCB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC0PINS_MC1_CUR_DCB_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC0PINS_MC1_CUR_DCB_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITADC0PINS_MC1_CUR_DCB_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT1_6 (number 99), MC1_Temp_IPM
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC0PINS_MC1_Temp_IPM_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC0PINS_MC1_Temp_IPM_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITADC0PINS_MC1_Temp_IPM_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT1_7 (number 100), MC1_TA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC0PINS_MC1_TA_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC0PINS_MC1_TA_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITADC0PINS_MC1_TA_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT0_18 (number 85), I_pfc1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC0PINS_I_pfc1_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC0PINS_I_pfc1_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITADC0PINS_I_pfc1_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT0_19 (number 86), I_pfc2
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC0PINS_I_pfc2_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC0PINS_I_pfc2_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITADC0PINS_I_pfc2_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT1_5 (number 98), MC1_VOLT_DCB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC0PINS_MC1_VOLT_DCB_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC0PINS_MC1_VOLT_DCB_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITADC0PINS_MC1_VOLT_DCB_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC0Pins(void);

#define PCR_IBE_ibe0 0x00u         /*!<@brief Input Buffer Enable: Disables */
#define PORT2_PCR5_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT1_10 (number 3), MC2_I_phA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_MC2_I_phA_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_MC2_I_phA_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_MC2_I_phA_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT1_11 (number 4), MC2_I_phB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_MC2_I_phB_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_MC2_I_phB_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_MC2_I_phB_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT1_12 (number 5), MC2_I_phC
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_MC2_I_phC_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_MC2_I_phC_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_MC2_I_phC_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT1_14 (number 7), MC2_CUR_DCB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_MC2_CUR_DCB_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_MC2_CUR_DCB_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_MC2_CUR_DCB_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT1_13 (number 6), MC2_VOLT_DCB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_MC2_VOLT_DCB_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_MC2_VOLT_DCB_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_MC2_VOLT_DCB_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT1_15 (number 8), MC3_I_phA
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_MC3_I_phA_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_MC3_I_phA_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_MC3_I_phA_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT2_1 (number 23), MC3_I_phB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_MC3_I_phB_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_MC3_I_phB_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_MC3_I_phB_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                              /* @} */

