nxp-appcodehub/dm-mc-pmsm-triple-mcxa34x/board/pin_mux.h
/*! @name PORT2_5 (number 27), MC3_I_phC
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_MC3_I_phC_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_MC3_I_phC_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_MC3_I_phC_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT3_30 (number 49), MC3_VOLT_DCB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_MC3_VOLT_DCB_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_MC3_VOLT_DCB_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_MC3_VOLT_DCB_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PORT2_3 (number 25), MC3_CUR_DCB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_MC3_CUR_DCB_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_MC3_CUR_DCB_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_MC3_CUR_DCB_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC1Pins(void);

#define PCR_IBE_ibe1 0x01u          /*!<@brief Input Buffer Enable: Enables */
#define PORT2_PCR23_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR6_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT2_23 (number 42), MCU_BRAKE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITGPIOPINS_MCU_BRAKE_GPIO GPIO2                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITGPIOPINS_MCU_BRAKE_GPIO_PIN 23U              /*!<@brief GPIO pin number */
#define BOARD_INITGPIOPINS_MCU_BRAKE_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITGPIOPINS_MCU_BRAKE_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGPIOPINS_MCU_BRAKE_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITGPIOPINS_MCU_BRAKE_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT3_18 (number 57), RLY_IN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITGPIOPINS_RLY_IN_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITGPIOPINS_RLY_IN_GPIO_PIN 18U              /*!<@brief GPIO pin number */
#define BOARD_INITGPIOPINS_RLY_IN_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITGPIOPINS_RLY_IN_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGPIOPINS_RLY_IN_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITGPIOPINS_RLY_IN_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT2_6 (number 28), MC3_CUR_DCB
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITGPIOPINS_MC3_CUR_DCB_GPIO GPIO2               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITGPIOPINS_MC3_CUR_DCB_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITGPIOPINS_MC3_CUR_DCB_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITGPIOPINS_MC3_CUR_DCB_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGPIOPINS_MC3_CUR_DCB_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITGPIOPINS_MC3_CUR_DCB_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitGPIOPins(void);

#define PCR_IBE_ibe0 0x00u /*!<@brief Input Buffer Enable: Disables */

/*! @name PORT1_4 (number 97), MC2_FAULT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITCMP0PINS_MC2_FAULT_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITCMP0PINS_MC2_FAULT_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITCMP0PINS_MC2_FAULT_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORT0_23 (number 90), MC1_CUR_DCB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITCMP0PINS_MC1_CUR_DCB_PORT PORT0                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITCMP0PINS_MC1_CUR_DCB_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITCMP0PINS_MC1_CUR_DCB_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                                 /* @} */

/*! @name PORT2_3 (number 25), MC3_CUR_DCB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITCMP0PINS_MC3_CUR_DCB_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITCMP0PINS_MC3_CUR_DCB_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITCMP0PINS_MC3_CUR_DCB_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCMP0Pins(void);

#define PCR_IBE_ibe0 0x00u /*!<@brief Input Buffer Enable: Disables */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOPAMP0Pins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT3_22 (number 53), MC3_BT
  @{ */

