nxp-appcodehub/dm-mc-pmsm-triple-mcxa34x/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_SMARTDMA0PINS_MC3_BT_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_SMARTDMA0PINS_MC3_BT_GPIO_PIN 21U              /*!<@brief GPIO pin number */
#define BOARD_SMARTDMA0PINS_MC3_BT_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SMARTDMA0PINS_MC3_BT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_SMARTDMA0PINS_MC3_BT_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_SMARTDMA0PINS_MC3_BT_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_21 (number 54), MC3_BB
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SMARTDMA0PINS_MC3_BB_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_SMARTDMA0PINS_MC3_BB_GPIO_PIN 22U              /*!<@brief GPIO pin number */
#define BOARD_SMARTDMA0PINS_MC3_BB_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SMARTDMA0PINS_MC3_BB_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_SMARTDMA0PINS_MC3_BB_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_SMARTDMA0PINS_MC3_BB_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_20 (number 55), MC3_CB
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SMARTDMA0PINS_MC3_CB_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_SMARTDMA0PINS_MC3_CB_GPIO_PIN 20U              /*!<@brief GPIO pin number */
#define BOARD_SMARTDMA0PINS_MC3_CB_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SMARTDMA0PINS_MC3_CB_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_SMARTDMA0PINS_MC3_CB_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_SMARTDMA0PINS_MC3_CB_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT3_19 (number 56), MC3_CT
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_SMARTDMA0PINS_MC3_CT_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_SMARTDMA0PINS_MC3_CT_GPIO_PIN 19U              /*!<@brief GPIO pin number */
#define BOARD_SMARTDMA0PINS_MC3_CT_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_SMARTDMA0PINS_MC3_CT_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_SMARTDMA0PINS_MC3_CT_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_SMARTDMA0PINS_MC3_CT_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_SmartDMA0Pins(void);

#define PCR_IBE_ibe1 0x01u          /*!<@brief Input Buffer Enable: Enables */
#define PORT2_PCR20_MUX_mux01 0x01u /*!<@brief Pin Multiplex Control: Alternative 1 (chip-specific) */
#define PORT2_PCR21_MUX_mux01 0x01u /*!<@brief Pin Multiplex Control: Alternative 1 (chip-specific) */

/*! @name PORT2_20 (number 40), MC1_ENC_A
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_EQDC0PINS_MC1_ENC_A_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_EQDC0PINS_MC1_ENC_A_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_EQDC0PINS_MC1_ENC_A_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT2_21 (number 41), MC1_ENC_B
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_EQDC0PINS_MC1_ENC_B_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_EQDC0PINS_MC1_ENC_B_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_EQDC0PINS_MC1_ENC_B_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_31 (number 48), MC1_ENC_I
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_EQDC0PINS_MC1_ENC_I_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_EQDC0PINS_MC1_ENC_I_PIN 31U                   /*!<@brief PORT pin number */
#define BOARD_EQDC0PINS_MC1_ENC_I_PIN_MASK (1U << 31U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_eQDC0Pins(void);

#define PCR_IBE_ibe1 0x01u         /*!<@brief Input Buffer Enable: Enables */
#define PORT4_PCR6_MUX_mux01 0x01u /*!<@brief Pin Multiplex Control: Alternative 1 (chip-specific) */
#define PORT4_PCR7_MUX_mux01 0x01u /*!<@brief Pin Multiplex Control: Alternative 1 (chip-specific) */

/*! @name PORT4_6 (number 20), MC2_ENC_A
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_EQDC1PINS_MC2_ENC_A_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_EQDC1PINS_MC2_ENC_A_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_EQDC1PINS_MC2_ENC_A_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT4_7 (number 21), MC2_ENC_B
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_EQDC1PINS_MC2_ENC_B_PORT PORT4               /*!<@brief PORT peripheral base pointer */
#define BOARD_EQDC1PINS_MC2_ENC_B_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_EQDC1PINS_MC2_ENC_B_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_eQDC1Pins(void);

#define PCR_IBE_ibe0 0x00u          /*!<@brief Input Buffer Enable: Disables */
#define PORT2_PCR17_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR19_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOPAMP1Pins(void);

#define PCR_IBE_ibe0 0x00u         /*!<@brief Input Buffer Enable: Disables */
#define PORT2_PCR2_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDACPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
